Emacs.org
#+title: Emacs initialization
#+OPTIONS: author:nil date:nil
#+FILETAGS: :emacs:

* Package management

#+begin_src emacs-lisp

  (require 'package)
  (setq package-archives '(
			   ("melpa" . "https://melpa.org/packages/")
			   ;; ("melpa-stable" . "https://stable.melpa.org/packages/")
			   ;; ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")
			   ))
  (package-initialize)

  (message "[INIT] successfully setup package managers")

#+end_src

* use-package

#+begin_src emacs-lisp

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (eval-when-compile
    (require 'use-package))

  (message "[INIT] successfully setup use-package")

#+end_src

- [[https://emacs.stackexchange.com/a/50603/30155][use-package won't load]]

* Constants

#+begin_src emacs-lisp

  (setq

   ;; full name of the user logged in
   user-full-name "Christopher E. Mower"


   ;; file used for storing customization information.
   custom-file (concat user-emacs-directory "/custom.el")

   ;; application that opens pdf documents
   pdf-open-application
   (cond
    ((string-equal system-type "gnu/linux") "evince")
    ((string-equal system-type "darwin") "open"))

   ;; default user directory for storing custom theme files
   custom-theme-directory "~/.emacs.d/themes"

   ;; number of lines of margin at the top and bottom of a window
   scroll-margin 5

   ;; the number of lines to try scrolling a window by when point moves out
   scroll-step 1

   ;; The day of the week on which a week in the calendar begins
   ;; 0 means Sunday (default), 1 means Monday, and so on
   calendar-week-start-day 1

   ;; inhibit the startup screen
   inhibit-splash-screen t

   )

  (message "[INIT] set constants")

#+end_src

** Resources

- https://stackoverflow.com/a/1817318/4650592
- https://www.reddit.com/r/emacs/comments/6dqap5/how_to_keep_initel_clean_if/
- https://emacs.stackexchange.com/a/59811/30155

* Custom functions

#+begin_src emacs-lisp

  (defun open-init-file ()
    "Open Emacs init file."
    (interactive)
    (find-file (expand-file-name "Emacs.org" user-emacs-directory)))

  (defun report-init-stage (str)
    (message (concat "[INIT] " str)))

  (report-init-stage "successfuly setup custom functions")

#+end_src

* User interface

** Theme

#+begin_src emacs-lisp
  ;; (load-theme 'spacegray t)
  (load-theme 'monokai t)

  (report-init-stage "successfully setup emacs theme")

#+end_src

** Appearance

#+begin_src emacs-lisp

  (scroll-bar-mode 0) ;; remove scroll bar
  (tool-bar-mode 0) ;; remove tool bar
  (menu-bar-mode 0) ;; remove menu bar
  (show-paren-mode 1) ;; highlight parentheses
  (global-hl-line-mode 1) ;; highlight current line
  (global-linum-mode 1) ;; show line numbers

  (report-init-stage "successfully setup appearance")

#+end_src

** Resources

- http://ergoemacs.org/emacs/emacs_highlight_parenthesis.html

* Magit

https://magit.vc/manual/magit/

#+begin_src emacs-lisp

  (use-package magit
    :ensure t)

  ;; Custom functions for opening GitHub from magit
  (defun parse-github-url (url)
    "convert a git remote location as a HTTP URL"
    (if (string-match "^http" url)
	url
      (replace-regexp-in-string "\\(.*\\)@\\(.*\\):\\(.*\\)\\(\\.git?\\)"
				"https://\\2/\\3"
				url)))

  (defun magit-open-repo ()
    "open remote repo URL"
    (interactive)
    (let ((url (magit-get "remote" "origin" "url")))
      (progn
	(browse-url (parse-github-url url))
	(message "Opening %s" url))))

  (add-hook 'magit-mode-hook
	    (lambda ()
	      (local-set-key (kbd "o") 'magit-open-repo)))

  (report-init-stage "successfully setup magit")

#+end_src

* Undo

#+begin_src emacs-lisp

  (use-package undo-tree
    :ensure t
    :init
    (setq undo-tree-visualizer-diff t)
    :config
    (global-undo-tree-mode))


  (report-init-stage "successfully setup undo-tree")

#+end_src

* Org

