Emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-18 Mon 16:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs initialization</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs initialization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6247444">1. Package management</a></li>
<li><a href="#orgd9fbc21">2. use-package</a></li>
<li><a href="#orgc6b8f37">3. Magit</a></li>
<li><a href="#org0746667">4. Org</a>
<ul>
<li><a href="#org8138665">4.1. Constants</a>
<ul>
<li><a href="#orgb0ab016">4.1.1. Resources</a></li>
</ul>
</li>
<li><a href="#org61462ff">4.2. Org files</a>
<ul>
<li><a href="#org6534c68">4.2.1. Resources</a></li>
</ul>
</li>
<li><a href="#org6c5886f">4.3. Appearance</a>
<ul>
<li><a href="#org6accfc2">4.3.1. Resources</a></li>
</ul>
</li>
<li><a href="#orgc8c26dd">4.4. org-babel</a></li>
<li><a href="#org83a48a8">4.5. org-ref</a>
<ul>
<li><a href="#orgbaedd32">4.5.1. Resources</a></li>
</ul>
</li>
<li><a href="#org78af4eb">4.6. org-super-agenda</a>
<ul>
<li><a href="#org917b814">4.6.1. Preliminary setup</a></li>
<li><a href="#org91ceab7">4.6.2. Main org-super-agenda configuration</a></li>
<li><a href="#orgde20ccc">4.6.3. Resources</a></li>
</ul>
</li>
<li><a href="#orgfeea37b">4.7. Finished Org</a></li>
</ul>
</li>
<li><a href="#org514f139">5. Keybindings</a></li>
<li><a href="#orga7b1f9d">6. Completed Emacs.org setup</a></li>
<li><a href="#org67cf91f">7. Local variables</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6247444" class="outline-2">
<h2 id="org6247444"><span class="section-number-2">1</span> Package management</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">package</span>)
(<span style="color: #a020f0;">setq</span> package-archives '(
                         (<span style="color: #8b2252;">"melpa"</span> . <span style="color: #8b2252;">"https://melpa.org/packages/"</span>)
                         <span style="color: #b22222;">;; </span><span style="color: #b22222;">("melpa-stable" . "https://stable.melpa.org/packages/")</span>
                         <span style="color: #b22222;">;; </span><span style="color: #b22222;">("org" . "https://orgmode.org/elpa/")</span>
                         (<span style="color: #8b2252;">"elpa"</span> . <span style="color: #8b2252;">"https://elpa.gnu.org/packages/"</span>)
                         ))
(package-initialize)

(message <span style="color: #8b2252;">"successfully setup package managers"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9fbc21" class="outline-2">
<h2 id="orgd9fbc21"><span class="section-number-2">2</span> use-package</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #a020f0;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(<span style="color: #a020f0;">eval-when-compile</span>
  (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">use-package</span>))

(message <span style="color: #8b2252;">"successfully setup use-package"</span>)
</pre>
</div>

<ul class="org-ul">
<li><a href="https://emacs.stackexchange.com/a/50603/30155">use-package won't load</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc6b8f37" class="outline-2">
<h2 id="orgc6b8f37"><span class="section-number-2">3</span> Magit</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://magit.vc/manual/magit/">https://magit.vc/manual/magit/</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">magit</span>
  <span style="color: #483d8b;">:ensure</span> t)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Custom functions for opening GitHub from magit</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">parse-github-url</span> (url)
  <span style="color: #8b2252;">"convert a git remote location as a HTTP URL"</span>
  (<span style="color: #a020f0;">if</span> (string-match <span style="color: #8b2252;">"^http"</span> url)
      url
    (replace-regexp-in-string <span style="color: #8b2252;">"</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">.*</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;">@</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">.*</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;">:</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">.*</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">\\.git?</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;">"</span>
                              <span style="color: #8b2252;">"https://\\2/\\3"</span>
                              url)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">magit-open-repo</span> ()
  <span style="color: #8b2252;">"open remote repo URL"</span>
  (<span style="color: #a020f0;">interactive</span>)
  (<span style="color: #a020f0;">let</span> ((url (magit-get <span style="color: #8b2252;">"remote"</span> <span style="color: #8b2252;">"origin"</span> <span style="color: #8b2252;">"url"</span>)))
    (<span style="color: #a020f0;">progn</span>
      (browse-url (parse-github-url url))
      (message <span style="color: #8b2252;">"Opening %s"</span> url))))

(add-hook 'magit-mode-hook
          (<span style="color: #a020f0;">lambda</span> ()
            (local-set-key (kbd <span style="color: #8b2252;">"o"</span>) 'magit-open-repo)))

(message <span style="color: #8b2252;">"successfully setup magit"</span>)

</pre>
</div>
</div>
</div>
