Emacs.org
** Constants

#+begin_src emacs-lisp

  (setq

   ;; default location to look for Org files
   org-directory "~/Dropbox/org"

   ;; font-lock should hide the emphasis marker characters
   org-hide-emphasis-markers t

   ;; turn on org-indent-mode on startup.
   org-startup-indented t

   ;; insert state change notes and time stamps into a drawer
   org-log-into-drawer t

   ;; information to record when a task moves to the DONE state.
   org-log-done t

   ;; default target for storing notes
   org-default-notes-file (concat org-directory "/quick.org")

   ;; name of the command for executing Python code.
   org-babel-python-command "python3"

   ;; commands to process a LaTeX file to a PDF file
   org-latex-pdf-process
   '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %b"
     "bibtex %b"
     "makeindex %b"
     "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %b"
     "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %b")

   ;; sorting structure for the agenda items of a single day
   org-agenda-sorting-strategy
   '((agenda habit-down time-up priority-down effort-up category-keep)
     (todo priority-down effort-up category-keep)
     (tags priority-down effort-up category-keep)
     (search category-keep))

   ;; don’t show deadlines when the corresponding item is done
   org-agenda-skip-deadline-if-done t

   ;; don’t show scheduled items in agenda when they are done
   org-agenda-skip-scheduled-if-done t

   ;; custom commands for the agenda
   org-agenda-custom-commands
   '(

     ;; view completed tasks today
     ("D" "Daily review"
      tags "+CLOSED>\"<-0d>\"/DONE")

     ;; view completed tasks during past week
     ("W" "Weekly review"
      tags "+CLOSED>\"<-7d>\"/DONE")

     ;; view completed tasks during past two weeks
     ("R" "Fortnightly review"
      tags "+CLOSED>\"<-14d>\"/DONE")

     ;; view completed tasks during past month
     ("N" "Monthly review"
      tags "+CLOSED>\"<-1m>\"/DONE")

     ;; view TODO items without a timestamp
     ("U" "Unscheduled TODO"
      ((todo ""
             ((org-agenda-overriding-header "\nUnscheduled TODO")
              (org-agenda-skip-function '(org-agenda-skip-entry-if 'timestamp)))))))


   ;; list of TODO entry keyword sequences and their interpretation
   org-todo-keywords
   '((sequence "TODO(t)" "|" "DONE(d)")
     (sequence "TODAY(o)" "|" "CANCELED(c)"))

   ;; faces for specific TODO keywords
   org-todo-keyword-faces
   '(("TODO" . (:foreground "#ffb347" :weight bold))
     ("DONE" . (:foreground "#037d50"))
     ("TODAY" . (:foreground "#add8e6" :weight bold))
     ("CANCELED" . (:foreground "red")))

   ;; external applications for opening ‘file:path’ items in a document
   org-file-apps
   (cond
    ((string-equal system-type "gnu/linux")
     '((auto-mode . emacs)
       ("\\.mm\\'" . default)
       ("\\.x?html?\\'" . default)
       ("\\.pdf\\'" . "evince %s")))
    ((string-equal system-type "darwin")
     '((auto-mode . emacs)
       ("\\.mm\\'" . default)
       ("\\.x?html?\\'" . default)
       ("\\.pdf\\'" . "open %s"))))

   )

#+end_src

*** Resources

- https://emacs.stackexchange.com/a/16561
- https://emacs.stackexchange.com/a/53007/30155
- https://www.reddit.com/r/orgmode/comments/jqu70x/how_to_create_a_custom_agenda_view_to_show_all/

** Org files

#+begin_src emacs-lisp

  ;; Add all .org files in org-directory recursively
  (load-library "find-lisp")
  (setq org-agenda-files (find-lisp-find-files org-directory "\.org$"))

  ;; Include .emacs.d
  (add-to-list 'org-agenda-files "~/.emacs.d")

#+end_src

*** Resources

- https://orgmode.org/list/81lit1jiol.fsf@gmail.com/t/

** Appearance

#+begin_src emacs-lisp

  ;; org-appear mode
  (use-package org-appear
    :ensure t
    :after org
    :init
    (setq org-appear-autolinks t)
    :hook (org-mode . org-appear-mode))

  ;; org-superstar
  (use-package org-superstar
    :ensure t
    :after org
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-headline-bullets-list
     '("◉" "●" "○" "▣" "■" "□" "▶" "▷")))

#+end_src

*** Resources

- https://github.com/awth13/org-appear
- https://github.com/daviwil/dotfiles/blob/master/Emacs.org#fonts-and-bullets
- https://github.com/integral-dw/org-superstar-mode

** org-babel

#+begin_src emacs-lisp

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((shell . t)
     (python . t)))

#+end_src

