Emacs.html

<div id="outline-container-org0746667" class="outline-2">
<h2 id="org0746667"><span class="section-number-2">4</span> Org</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8138665" class="outline-3">
<h3 id="org8138665"><span class="section-number-3">4.1</span> Constants</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #a020f0;">setq</span>

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">default location to look for Org files</span>
 org-directory <span style="color: #8b2252;">"~/Dropbox/org"</span>

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">font-lock should hide the emphasis marker characters</span>
 org-hide-emphasis-markers t

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">turn on org-indent-mode on startup.</span>
 org-startup-indented t

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">insert state change notes and time stamps into a drawer</span>
 org-log-into-drawer t

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">information to record when a task moves to the DONE state.</span>
 org-log-done t

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">default target for storing notes</span>
 org-default-notes-file (concat org-directory <span style="color: #8b2252;">"/quick.org"</span>)

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">name of the command for executing Python code.</span>
 org-babel-python-command <span style="color: #8b2252;">"python3"</span>

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">commands to process a LaTeX file to a PDF file</span>
 org-latex-pdf-process
 '(<span style="color: #8b2252;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %b"</span>
   <span style="color: #8b2252;">"bibtex %b"</span>
   <span style="color: #8b2252;">"makeindex %b"</span>
   <span style="color: #8b2252;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %b"</span>
   <span style="color: #8b2252;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %b"</span>)

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">sorting structure for the agenda items of a single day</span>
 org-agenda-sorting-strategy
 '((agenda habit-down time-up priority-down effort-up category-keep)
   (todo priority-down effort-up category-keep)
   (tags priority-down effort-up category-keep)
   (search category-keep))

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">don&#8217;t show deadlines when the corresponding item is done</span>
 org-agenda-skip-deadline-if-done t

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">don&#8217;t show scheduled items in agenda when they are done</span>
 org-agenda-skip-scheduled-if-done t

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">custom commands for the agenda</span>
 org-agenda-custom-commands
 '(

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">view completed tasks today</span>
   (<span style="color: #8b2252;">"D"</span> <span style="color: #8b2252;">"Daily review"</span>
    tags <span style="color: #8b2252;">"+CLOSED&gt;\"&lt;-0d&gt;\"/DONE"</span>)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">view completed tasks during past week</span>
   (<span style="color: #8b2252;">"W"</span> <span style="color: #8b2252;">"Weekly review"</span>
    tags <span style="color: #8b2252;">"+CLOSED&gt;\"&lt;-7d&gt;\"/DONE"</span>)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">view completed tasks during past two weeks</span>
   (<span style="color: #8b2252;">"R"</span> <span style="color: #8b2252;">"Fortnightly review"</span>
    tags <span style="color: #8b2252;">"+CLOSED&gt;\"&lt;-14d&gt;\"/DONE"</span>)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">view completed tasks during past month</span>
   (<span style="color: #8b2252;">"N"</span> <span style="color: #8b2252;">"Monthly review"</span>
    tags <span style="color: #8b2252;">"+CLOSED&gt;\"&lt;-1m&gt;\"/DONE"</span>)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">view TODO items without a timestamp</span>
   (<span style="color: #8b2252;">"U"</span> <span style="color: #8b2252;">"Unscheduled TODO"</span>
    ((todo <span style="color: #8b2252;">""</span>
           ((org-agenda-overriding-header <span style="color: #8b2252;">"\nUnscheduled TODO"</span>)
            (org-agenda-skip-function '(org-agenda-skip-entry-if 'timestamp)))))))


 <span style="color: #b22222;">;; </span><span style="color: #b22222;">list of TODO entry keyword sequences and their interpretation</span>
 org-todo-keywords
 '((sequence <span style="color: #8b2252;">"TODO(t)"</span> <span style="color: #8b2252;">"|"</span> <span style="color: #8b2252;">"DONE(d)"</span>)
   (sequence <span style="color: #8b2252;">"TODAY(o)"</span> <span style="color: #8b2252;">"|"</span> <span style="color: #8b2252;">"CANCELED(c)"</span>))

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">faces for specific TODO keywords</span>
 org-todo-keyword-faces
 '((<span style="color: #8b2252;">"TODO"</span> . (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"#ffb347"</span> <span style="color: #483d8b;">:weight</span> bold))
   (<span style="color: #8b2252;">"DONE"</span> . (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"#037d50"</span>))
   (<span style="color: #8b2252;">"TODAY"</span> . (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"#add8e6"</span> <span style="color: #483d8b;">:weight</span> bold))
   (<span style="color: #8b2252;">"CANCELED"</span> . (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"red"</span>)))

 )

</pre>
</div>
</div>

<div id="outline-container-orgb0ab016" class="outline-4">
<h4 id="orgb0ab016"><span class="section-number-4">4.1.1</span> Resources</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li><a href="https://emacs.stackexchange.com/a/16561">https://emacs.stackexchange.com/a/16561</a></li>
<li><a href="https://emacs.stackexchange.com/a/53007/30155">https://emacs.stackexchange.com/a/53007/30155</a></li>
<li><a href="https://www.reddit.com/r/orgmode/comments/jqu70x/how_to_create_a_custom_agenda_view_to_show_all/">https://www.reddit.com/r/orgmode/comments/jqu70x/how_to_create_a_custom_agenda_view_to_show_all/</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org61462ff" class="outline-3">
<h3 id="org61462ff"><span class="section-number-3">4.2</span> Org files</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Add all .org files in org-directory recursively</span>
(load-library <span style="color: #8b2252;">"find-lisp"</span>)
(<span style="color: #a020f0;">setq</span> org-agenda-files (find-lisp-find-files org-directory <span style="color: #8b2252;">"</span><span style="color: #ff0000; font-weight: bold;">\</span><span style="color: #8b2252;">.org$"</span>))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Include .emacs.d</span>
(add-to-list 'org-agenda-files <span style="color: #8b2252;">"~/.emacs.d"</span>)

</pre>
</div>
</div>

<div id="outline-container-org6534c68" class="outline-4">
<h4 id="org6534c68"><span class="section-number-4">4.2.1</span> Resources</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li><a href="https://orgmode.org/list/81lit1jiol.fsf@gmail.com/t/">https://orgmode.org/list/81lit1jiol.fsf@gmail.com/t/</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6c5886f" class="outline-3">
<h3 id="org6c5886f"><span class="section-number-3">4.3</span> Appearance</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">org-appear mode</span>
(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">org-appear</span>
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:after</span> org
  <span style="color: #483d8b;">:init</span>
  (<span style="color: #a020f0;">setq</span> org-appear-autolinks t)
  <span style="color: #483d8b;">:hook</span> (org-mode . org-appear-mode))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">org-superstar</span>
(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">org-superstar</span>
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:after</span> org
  <span style="color: #483d8b;">:hook</span> (org-mode . org-superstar-mode)
  <span style="color: #483d8b;">:custom</span>
  (org-superstar-headline-bullets-list
   '(<span style="color: #8b2252;">"&#9673;"</span> <span style="color: #8b2252;">"&#9679;"</span> <span style="color: #8b2252;">"&#9675;"</span> <span style="color: #8b2252;">"&#9635;"</span> <span style="color: #8b2252;">"&#9632;"</span> <span style="color: #8b2252;">"&#9633;"</span> <span style="color: #8b2252;">"&#9654;"</span> <span style="color: #8b2252;">"&#9655;"</span>)))

</pre>
</div>
</div>

<div id="outline-container-org6accfc2" class="outline-4">
<h4 id="org6accfc2"><span class="section-number-4">4.3.1</span> Resources</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li><a href="https://github.com/awth13/org-appear">https://github.com/awth13/org-appear</a></li>
<li><a href="https://github.com/daviwil/dotfiles/blob/master/Emacs.org#fonts-and-bullets">https://github.com/daviwil/dotfiles/blob/master/Emacs.org#fonts-and-bullets</a></li>
<li><a href="https://github.com/integral-dw/org-superstar-mode">https://github.com/integral-dw/org-superstar-mode</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc8c26dd" class="outline-3">
<h3 id="orgc8c26dd"><span class="section-number-3">4.4</span> org-babel</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(org-babel-do-load-languages
 'org-babel-load-languages
 '((shell . t)
   (python . t)))

</pre>
</div>
</div>
</div>
