Emacs.html

<div id="outline-container-org83a48a8" class="outline-3">
<h3 id="org83a48a8"><span class="section-number-3">4.5</span> org-ref</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">org-ref</span>
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:init</span>
  (<span style="color: #a020f0;">setq</span> org-ref-bibliography-notes <span style="color: #8b2252;">"~/Dropbox/org/reading.org"</span>
        org-ref-default-bibliography '(<span style="color: #8b2252;">"~/Dropbox/org/bib/bib.bib"</span>)))

</pre>
</div>

<p>
Note, when writing \(\LaTeX\) equations, the standard environment to use is
</p>
<div class="org-src-container">
<pre class="src src-:tangle">\begin{equation}
  E = mc^2
\end{equation}
</pre>
</div>
<p>
however, when writing \(\LaTeX\) in Org-mode files, use
</p>
<div class="org-src-container">
<pre class="src src-:tangle">#+begin_export latex
  E = mc^2
#+end_export
</pre>
</div>
</div>

<div id="outline-container-orgbaedd32" class="outline-4">
<h4 id="orgbaedd32"><span class="section-number-4">4.5.1</span> Resources</h4>
<div class="outline-text-4" id="text-4-5-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=2t925KRBbFc">https://www.youtube.com/watch?v=2t925KRBbFc</a></li>
<li><a href="https://emacs.stackexchange.com/a/58641/30155">https://emacs.stackexchange.com/a/58641/30155</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org78af4eb" class="outline-3">
<h3 id="org78af4eb"><span class="section-number-3">4.6</span> org-super-agenda</h3>
<div class="outline-text-3" id="text-4-6">
<p>
<a href="https://github.com/alphapapa/org-super-agenda">https://github.com/alphapapa/org-super-agenda</a>
</p>
</div>

<div id="outline-container-org917b814" class="outline-4">
<h4 id="org917b814"><span class="section-number-4">4.6.1</span> Preliminary setup</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
The following date indicators are required in the <code>org-super-agenda</code> setup in the next section.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Return day of week: Sun=0, Mon=1, Tues=2, ..., Sat=6</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">get-day-from-now</span> (n)
  (<span style="color: #a020f0;">-let*</span>
      (((sec minute hour day month year dow dst utcoff)
        (decode-time (+ (* n 86400) (float-time)))))
    dow)) <span style="color: #b22222;">;; </span><span style="color: #b22222;">dow &lt;=&gt; day-of-week</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Get day of week today</span>
(<span style="color: #a020f0;">setq</span> day-of-week-today (get-day-from-now 0))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Get day of week end</span>
(<span style="color: #a020f0;">-let*</span> (((sec minute hour day month year dow dst utcoff) (decode-time (+ (* (- 8 day-of-week-today) 86400) (float-time)))))
  (<span style="color: #a020f0;">setq</span> org-end-of-week (format <span style="color: #8b2252;">"%d-%02d-%02d"</span> year month day)))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Get day of week soon date (i.e. 4 days)</span>
(<span style="color: #a020f0;">-let*</span> (((sec minute hour day month year dow dst utcoff) (decode-time (+ (* 4 86400) (float-time))))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">4 days</span>
  (<span style="color: #a020f0;">setq</span> org-soon-date (format <span style="color: #8b2252;">"%d-%02d-%02d"</span> year month day)))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Get day of week tomorrow date</span>
(<span style="color: #a020f0;">-let*</span> (((sec minute hour day month year dow dst utcoff) (decode-time (+ (* 2 86400) (float-time))))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">2 days</span>
  (<span style="color: #a020f0;">setq</span> org-tomorrow-date (format <span style="color: #8b2252;">"%d-%02d-%02d"</span> year month day)))

</pre>
</div>
</div>
</div>

<div id="outline-container-org91ceab7" class="outline-4">
<h4 id="org91ceab7"><span class="section-number-4">4.6.2</span> Main org-super-agenda configuration</h4>
<div class="outline-text-4" id="text-4-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">org-super-agenda</span>
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (org-super-agenda-mode t)
  (<span style="color: #a020f0;">setq</span> org-super-agenda-groups
        `((<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Today"</span> <span style="color: #483d8b;">:time-grid</span> t)
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Scheduled"</span> <span style="color: #483d8b;">:scheduled</span> past)
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Overdue reading"</span> <span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:deadline</span> past <span style="color: #483d8b;">:tag</span> <span style="color: #8b2252;">"reading"</span>))
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Overdue"</span> <span style="color: #483d8b;">:deadline</span> past)
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Scheduled Today"</span> <span style="color: #483d8b;">:todo</span> <span style="color: #8b2252;">"TODAY"</span>)
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Read by today"</span> <span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:deadline</span> today <span style="color: #483d8b;">:tag</span> <span style="color: #8b2252;">"reading"</span>))
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Watch today"</span> <span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:deadline</span> today <span style="color: #483d8b;">:tag</span> <span style="color: #8b2252;">"watch"</span>))
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"By today"</span> <span style="color: #483d8b;">:deadline</span> today)
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Read tomorrow"</span> <span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:deadline</span> (before ,org-tomorrow-date) <span style="color: #483d8b;">:tag</span> <span style="color: #8b2252;">"reading"</span>))
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"By tomorrow"</span> <span style="color: #483d8b;">:deadline</span> (before ,org-tomorrow-date))
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Read by EOW"</span> <span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:deadline</span> (before ,org-end-of-week) <span style="color: #483d8b;">:tag</span> <span style="color: #8b2252;">"reading"</span>))
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Watch by EOW"</span> <span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:deadline</span> (before ,org-end-of-week) <span style="color: #483d8b;">:tag</span> <span style="color: #8b2252;">"watch"</span>))
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"By EOW"</span> <span style="color: #483d8b;">:deadline</span> (before ,org-end-of-week))
          (<span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"Reading"</span> <span style="color: #483d8b;">:tag</span> <span style="color: #8b2252;">"reading"</span>))))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgde20ccc" class="outline-4">
<h4 id="orgde20ccc"><span class="section-number-4">4.6.3</span> Resources</h4>
<div class="outline-text-4" id="text-4-6-3">
<ul class="org-ul">
<li><a href="https://stackoverflow.com/a/67741229">https://stackoverflow.com/a/67741229</a></li>
<li><a href="https://github.com/alphapapa/org-super-agenda/blob/master/examples.org#concrete-dates">https://github.com/alphapapa/org-super-agenda/blob/master/examples.org#concrete-dates</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfeea37b" class="outline-3">
<h3 id="orgfeea37b"><span class="section-number-3">4.7</span> Finished Org</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(message <span style="color: #8b2252;">"successfully setup Org"</span>)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org514f139" class="outline-2">
<h2 id="org514f139"><span class="section-number-2">5</span> Keybindings</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Org</span>
(global-set-key (kbd <span style="color: #8b2252;">"C-c l"</span>) 'org-store-link)
(global-set-key (kbd <span style="color: #8b2252;">"C-c a"</span>) 'org-agenda)
(global-set-key (kbd <span style="color: #8b2252;">"C-c c"</span>) 'org-capture)

</pre>
</div>
</div>
</div>

<div id="outline-container-orga7b1f9d" class="outline-2">
<h2 id="orga7b1f9d"><span class="section-number-2">6</span> Completed Emacs.org setup</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(message <span style="color: #8b2252;">"finished Emacs.org setup"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org67cf91f" class="outline-2">
<h2 id="org67cf91f"><span class="section-number-2">7</span> Local variables</h2>
<div class="outline-text-2" id="text-7">
<p>
View this file as a text file.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-04-18 Mon 16:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
